ArminJo/android-blue-display/STM32/lib/blueDisplay/src/BlueSerial.cpp
/*
 * BlueSerial.cpp
 *
 *   SUMMARY
 *  Blue Display is an Open Source Android remote Display for Arduino etc.
 *  It receives basic draw requests from Arduino etc. over Bluetooth and renders it.
 *  It also implements basic GUI elements as buttons and sliders.
 *  GUI callback, touch and sensor events are sent back to Arduino.
 *
 *  Copyright (C) 2014  Armin Joachimsmeyer
 *  armin.joachimsmeyer@gmail.com
 *
 *  This file is part of BlueDisplay.
 *  BlueDisplay is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.

 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.

 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/gpl.html>.
 *
 */

#include "BlueSerial.h"
#include "EventHandler.h"
#include "timing.h"
#include "stm32fx0xPeripherals.h" // For Watchdog_reload()

#include <string.h> // for memcpy
#include <stdarg.h>  // for varargs
/*
 * Serial Display protocol values
 */
//#define USE_SIMPLE_SERIAL
// Data field types
const int DATAFIELD_TAG_BYTE = 0x01;
const int DATAFIELD_TAG_SHORT = 0x02;
const int DATAFIELD_TAG_INT = 0x03;
const int DATAFIELD_TAG_LONG = 0x04;
const int DATAFIELD_TAG_FLOAT = 0x05;
const int DATAFIELD_TAG_DOUBLE = 0x06;
const int LAST_FUNCTION_TAG_DATAFIELD = 0x07;

#define MAX_NUMBER_OF_ARGS 12 // for sending
#define TOUCH_COMMAND_SIZE_BYTE_MAX  TOUCH_CALLBACK_DATA_SIZE + 3 // for receiving plausi

DMA_HandleTypeDef DMA_UART_BD_TXHandle;
DMA_HandleTypeDef DMA_UART_BD_RXHandle;
UART_HandleTypeDef UART_BD_Handle;

/**
 * UART receive is done via continuous DMA transfer to a circular receive buffer.
 * At this time only touch events of 6 byte are transferred.
 * The thread process checks the receive buffer via checkTouchReceived
 * and marks processed events by just clearing the data.
 * Buffer overrun is detected by using a Buffer size of (n*6)-1 so the sync token
 * in case of overrun is on another position than the one expected.
 *
 * UART sending is done by writing data to a circular send buffer and then starting the DMA for this data.
 * During transmission further data can be written into the buffer until it is full.
 * The next write then waits for the ongoing transmission(s) to end (blocking wait) until enough free space is available.
 * If an transmission ends, the buffer space used for this transmission gets available for next send data.
 * If there is more data in the buffer to send, then the next DMA transfer for the remaining data is started immediately.
 */

/*
 * UART constants
 */
// send buffer
#define UART_SEND_BUFFER_SIZE 1024
uint8_t * sUSARTSendBufferPointerIn; // only set by thread - point to first byte of free buffer space
volatile uint8_t * sUSARTSendBufferPointerOut; // only set by ISR - point to first byte not yet transfered
uint8_t USARTSendBuffer[UART_SEND_BUFFER_SIZE] __attribute__ ((aligned(4)));
uint8_t * sUSARTSendBufferPointerOutTmp; // value of sUSARTSendBufferPointerOut after transfer complete
volatile bool sDMATransferOngoing = false;  // synchronizing flag for ISR <-> thread

// Circular receive buffer
#define USART_RECEIVE_BUFFER_SIZE (TOUCH_COMMAND_SIZE_BYTE_MAX * 10 -1) // not a multiple of TOUCH_COMMAND_SIZE_BYTE in order to discover overruns
uint8_t USARTReceiveBuffer[USART_RECEIVE_BUFFER_SIZE] __attribute__ ((aligned(4)));
uint8_t * sUSARTReceiveBufferPointer; // point to first byte not yet processed (of next received message)
int32_t sLastRXDMACount;
bool sReceiveBufferOutOfSync = false;

/**
 * Init the input for Bluetooth HC-05 state pin
 * Initialization of clock and the RX and TX pins
 * Initialization of the RX and TX DMA channels and buffer pointer.
 * Starting the RX channel.
 */
void HAL_UART_MspInit(UART_HandleTypeDef * aUARTHandle) {
    if (aUARTHandle == &UART_BD_Handle) {
        UART_BD_CLOCK_ENABLE()
        ;
        UART_BD_IO_CLOCK_ENABLE()
        ;

        GPIO_InitTypeDef GPIO_InitStructure;
        // Bluetooth state pin
        GPIO_InitStructure.Pin = BLUETOOTH_PAIRED_DETECT_PIN;
        GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
        GPIO_InitStructure.Pull = GPIO_PULLDOWN; // Input is active high
        HAL_GPIO_Init(BLUETOOTH_PAIRED_DETECT_PORT, &GPIO_InitStructure);

#ifdef STM32F30X
        // Configure UART pins:   Tx (10)  and Rx (11) on Port C
        // Since the AF codes are the same, we can do it in one call
        GPIO_InitStructure.Pin = UART_BD_TX_PIN | UART_BD_RX_PIN;
        GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStructure.Pull = GPIO_PULLUP;
        GPIO_InitStructure.Alternate = GPIO_AF7_USART3;
#else
        // need 2 calls
        GPIO_InitStructure.Pin = UART_BD_TX_PIN;
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
        HAL_GPIO_Init(UART_BD_PORT, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = UART_BD_RX_PIN;
        GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
        GPIO_InitStructure.Pull = GPIO_NOPULL;
#endif
        HAL_GPIO_Init(UART_BD_PORT, &GPIO_InitStructure);

        UART_BD_DMA_CLOCK_ENABLE()
        ;
        DMA_UART_BD_TXHandle.Instance = UART_BD_DMA_TX_CHANNEL;

        /*
         * init TX channel and buffer pointer
         */
        sUSARTSendBufferPointerIn = &USARTSendBuffer[0];
        sUSARTSendBufferPointerOut = &USARTSendBuffer[0];
        DMA_UART_BD_TXHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
        DMA_UART_BD_TXHandle.Init.PeriphInc = DMA_PINC_DISABLE;
        DMA_UART_BD_TXHandle.Init.MemInc = DMA_MINC_ENABLE;
        DMA_UART_BD_TXHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        DMA_UART_BD_TXHandle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        DMA_UART_BD_TXHandle.Init.Mode = DMA_NORMAL;
        DMA_UART_BD_TXHandle.Init.Priority = DMA_PRIORITY_LOW;
        HAL_DMA_Init(&DMA_UART_BD_TXHandle);

        // Link to UART otherwise HAL_USART_Transmit_DMA crashes with nullpointer
        __HAL_LINKDMA(&UART_BD_Handle, hdmatx, DMA_UART_BD_TXHandle);

