ArminJo/android-blue-display/STM32/lib/blueDisplay/src/BlueSerial.cpp
#ifdef STM32F30X
        DMA_UART_BD_TXHandle.Instance->CPAR = (uint32_t) &UART_BD_Handle.Instance->TDR;
#else
        DMA_UART_BD_TXHandle.Instance->CPAR = (uint32_t) &UART_BD_Handle.Instance->DR;
#endif
        UART_BD_Handle.Instance->CR3 |= USART_CR3_DMAT; // enable DMA transmit

        /*
         * init RX channel and buffer pointer
         */
        DMA_UART_BD_RXHandle.Instance = UART_BD_DMA_RX_CHANNEL;

        sUSARTReceiveBufferPointer = &USARTReceiveBuffer[0];
        sLastRXDMACount = USART_RECEIVE_BUFFER_SIZE;

        DMA_UART_BD_RXHandle.Init.Direction = DMA_PERIPH_TO_MEMORY;
        DMA_UART_BD_RXHandle.Init.PeriphInc = DMA_PINC_DISABLE;
        DMA_UART_BD_RXHandle.Init.MemInc = DMA_MINC_ENABLE;
        DMA_UART_BD_RXHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        DMA_UART_BD_RXHandle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        DMA_UART_BD_RXHandle.Init.Mode = DMA_CIRCULAR;
        DMA_UART_BD_RXHandle.Init.Priority = DMA_PRIORITY_LOW;
        HAL_DMA_Init(&DMA_UART_BD_RXHandle);

        __HAL_LINKDMA(&UART_BD_Handle, hdmarx, DMA_UART_BD_RXHandle);

        // set register manually
#ifdef STM32F30X
        DMA_UART_BD_RXHandle.Instance->CPAR = (uint32_t) &UART_BD_Handle.Instance->RDR;
#else
        DMA_UART_BD_RXHandle.Instance->CPAR = (uint32_t) &UART_BD_Handle.Instance->DR;
#endif
        DMA_UART_BD_RXHandle.Instance->CMAR = (uint32_t) sUSARTReceiveBufferPointer;
        // Write to DMA Channel CNDTR
        DMA_UART_BD_RXHandle.Instance->CNDTR = USART_RECEIVE_BUFFER_SIZE;

        UART_BD_Handle.Instance->CR3 |= USART_CR3_DMAR; // enable DMA receive
        DMA_UART_BD_RXHandle.Instance->CCR |= DMA_CCR_EN; // Channel enable - no interrupts!
    }
}

/**
 * Initialization of the USART itself and the NVIC for the interrupts.
 */
void UART_BD_initialize(uint32_t aBaudRate) {

    UART_BD_Handle.Instance = UART_BD;

    UART_BD_Handle.Init.BaudRate = aBaudRate;
    UART_BD_Handle.Init.WordLength = UART_WORDLENGTH_8B;
    UART_BD_Handle.Init.StopBits = UART_STOPBITS_1;
    UART_BD_Handle.Init.Parity = UART_PARITY_NONE;
    UART_BD_Handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UART_BD_Handle.Init.Mode = UART_MODE_TX_RX; // receiver and transmitter enable
    HAL_UART_Init(&UART_BD_Handle);

//    USART_ITConfig(UART_BD_Handle.Instance, USART_IT_RXNE, ENABLE);   // enable Receive and overrun Interrupt
//    USART_ITConfig(UART_BD_Handle.Instance, USART_IT_TC, ENABLE); // enable the UART transfer_complete interrupt

    /* Enable USART IRQ to lowest prio*/
    NVIC_SetPriority((IRQn_Type) (UART_BD_IRQ), 3);
    HAL_NVIC_EnableIRQ((IRQn_Type) (UART_BD_IRQ));
}

void setUART_BD_BaudRate(uint32_t aBaudRate) {
    UART_BD_Handle.Init.BaudRate = aBaudRate;
    UART_BD_Handle.Instance->BRR = (uint16_t) (HAL_RCC_GetPCLK1Freq() / UART_BD_Handle.Init.BaudRate);
}

uint32_t getUSART_BD_BaudRate(void) {
    return UART_BD_Handle.Init.BaudRate;
}

/**
 * Not used yet
 * Reset RX_DMA count and start address to initial values.
 * Used by buffer error/overrun handling
 */
void UART_BD_DMA_RX_reset(void) {
// Disable DMA1 channel2 - is really needed here!
    UART_BD_Handle.hdmarx->Instance->CCR &= ~DMA_CCR_EN;

// Write to DMA1 CMAR
    UART_BD_Handle.hdmarx->Instance->CMAR = (uint32_t) &USARTReceiveBuffer[0];
    sUSARTReceiveBufferPointer = &USARTReceiveBuffer[0];
    // clear receive buffer
    memset(&USARTReceiveBuffer[0], 0, USART_RECEIVE_BUFFER_SIZE);

    // Write to DMA1 CNDTR
    UART_BD_Handle.hdmarx->Instance->CNDTR = USART_RECEIVE_BUFFER_SIZE;
    UART_BD_Handle.hdmarx->Instance->CCR |= DMA_CCR_EN; // No interrupts!
}

/**
 * Starts a new DMA to USART transfer with the given parameters.
 * Assert that USART is ready for new transfer.
 * No further parameter check is done here!
 */
void UART_BD_DMA_TX_start(uint32_t aMemoryBaseAddr, uint32_t aBufferSize) {
    if (sDMATransferOngoing) {
        return; // not allowed to start a new transfer, because DMA is busy
    }

    // assertion if no Transfer ongoing, but USART TX Buffer not empty
    assert_param(__HAL_UART_GET_FLAG(&UART_BD_Handle, UART_FLAG_TXE ) != RESET);

    sDMATransferOngoing = true;

    // Compute next buffer out pointer
    uint8_t * tUSARTSendBufferPointerOutTmp = (uint8_t *) (aMemoryBaseAddr + aBufferSize);
    // check for buffer wrap around
    if (tUSARTSendBufferPointerOutTmp >= &USARTSendBuffer[UART_SEND_BUFFER_SIZE]) {
        tUSARTSendBufferPointerOutTmp = &USARTSendBuffer[0];
    }
    sUSARTSendBufferPointerOutTmp = tUSARTSendBufferPointerOutTmp;

    if (aBufferSize == 1) {
        // no DMA needed just put data to TDR register
#ifdef STM32F30X
        UART_BD_Handle.Instance->TDR = *(uint8_t*) aMemoryBaseAddr;
#else
        UART_BD_Handle.Instance->DR = *(uint8_t*) aMemoryBaseAddr;
#endif
    } else {
        // Disable DMA channel - it is really needed here!
        UART_BD_Handle.hdmatx->Instance->CCR &= ~DMA_CCR_EN;

        // Write to DMA Channel CMAR
        UART_BD_Handle.hdmatx->Instance->CMAR = aMemoryBaseAddr;
        // Write to DMA Channel CNDTR
        UART_BD_Handle.hdmatx->Instance->CNDTR = aBufferSize;
        //USART_ClearFlag(UART_BD_Handle.Instance, USART_FLAG_TC);
#ifdef STM32F30X
        __HAL_UART_CLEAR_IT(&UART_BD_Handle, UART_CLEAR_TCF);
#else
        __HAL_UART_CLEAR_FLAG(&UART_BD_Handle, UART_FLAG_TC);
#endif
        // enable DMA channel
        UART_BD_Handle.hdmatx->Instance->CCR |= DMA_CCR_EN;
        //DMA_Cmd(USART_DMA_TX_CHANNEL, ENABLE); // No DMA interrupts!
    }
    // Enable USART TC interrupt
    __HAL_UART_ENABLE_IT(&UART_BD_Handle, UART_IT_TC);
}

/**
 * We must wait for USART transfer complete before starting next DMA,
 * otherwise the last byte of the transfer will be corrupted!!!
 * Therefore we must use USART and not the DMA TC interrupt!
 */
extern "C" void UART_BD_IRQHANDLER(void) {
    //if (USART_GetITStatus(UART_BD_Handle.Instance, USART_IT_TC) != RESET) {
    if (__HAL_UART_GET_FLAG(&UART_BD_Handle, UART_FLAG_TC) != RESET) {

