ArminJo/android-blue-display/STM32/lib/blueDisplay/src/BlueSerial.cpp
        sUSARTSendBufferPointerOut = sUSARTSendBufferPointerOutTmp;
        sDMATransferOngoing = false;
        if (sUSARTSendBufferPointerOut == sUSARTSendBufferPointerIn) {
            // transfer complete and no new data arrived in buffer
            /*
             * !! USART_ClearFlag(UART_BD_Handle.Instance, USART_FLAG_TC) has no effect on the TC Flag !!!! => next interrupt will happen after return from ISR
             * Must disable interrupt here otherwise it will interrupt forever (STM bug???)
             */
            __HAL_UART_DISABLE_IT(&UART_BD_Handle, UART_IT_TC);
            //USART_ITConfig(UART_BD_Handle.Instance, USART_IT_TC, DISABLE);
            //USART_ClearFlag(UART_BD_Handle.Instance, USART_FLAG_TC );
        } else {
            uint8_t * tUSARTSendBufferPointerIn = sUSARTSendBufferPointerIn;
            if (sUSARTSendBufferPointerOut < tUSARTSendBufferPointerIn) {
                // new data in buffer -> start new transfer
                UART_BD_DMA_TX_start((uint32_t) sUSARTSendBufferPointerOut,
                        (uint32_t) (tUSARTSendBufferPointerIn - sUSARTSendBufferPointerOut));
            } else {
                // new data, but buffer wrap around occurred - send tail of buffer
                UART_BD_DMA_TX_start((uint32_t) sUSARTSendBufferPointerOut,
                        &USARTSendBuffer[UART_SEND_BUFFER_SIZE] - sUSARTSendBufferPointerOut);
            }
        }
    }
}

/*
 * Buffer handling
 */

/**
 * put data byte and check for wrap around
 */
uint8_t * putSendBuffer(uint8_t * aUSARTSendBufferPointerIn, uint8_t aData) {
    *aUSARTSendBufferPointerIn++ = aData;
    // check for buffer wrap around
    if (aUSARTSendBufferPointerIn >= &USARTSendBuffer[UART_SEND_BUFFER_SIZE]) {
        aUSARTSendBufferPointerIn = &USARTSendBuffer[0];
    }
    return aUSARTSendBufferPointerIn;
}

int getSendBufferFreeSpace(void) {
    if (sUSARTSendBufferPointerOut == sUSARTSendBufferPointerIn && !sDMATransferOngoing) {
        // buffer empty
        return UART_SEND_BUFFER_SIZE;
    }
    if (sUSARTSendBufferPointerOut < sUSARTSendBufferPointerIn) {
        return (UART_SEND_BUFFER_SIZE - (sUSARTSendBufferPointerIn - sUSARTSendBufferPointerOut));
    }
    // buffer is completely filled up with data or buffer wrap around
    return (sUSARTSendBufferPointerOut - sUSARTSendBufferPointerIn);
}

/**
 * Copy content of both buffers to send buffer, check for buffer wrap around and call USART_BD_DMA_TX_start() with right parameters.
 * Do blocking wait if not enough space left in buffer
 */
void sendUSARTBufferNoSizeCheck(uint8_t * aParameterBufferPointer, int aParameterBufferLength, uint8_t * aDataBufferPointer,
        int aDataBufferLength) {
#ifdef USE_SIMPLE_SERIAL
    sendUSARTBufferSimple(aParameterBufferPointer, aParameterBufferLength, aDataBufferPointer, aDataBufferLength);
return;
#else


    if (!sDMATransferOngoing) {
        // safe to reset buffer pointers since no transmit pending
        sUSARTSendBufferPointerOut = &USARTSendBuffer[0];
        sUSARTSendBufferPointerIn = &USARTSendBuffer[0];
    }
    uint8_t * tUSARTSendBufferPointerIn = sUSARTSendBufferPointerIn;
    int tSize = aParameterBufferLength + aDataBufferLength;
    /*
     * check (and wait) for enough free space
     */
    if (getSendBufferFreeSpace() < tSize) {
        // not enough space left - wait for transfer (chain) to complete or for size
        // get interrupt level
        uint32_t tISPR = (__get_IPSR() & 0xFF);
        setTimeoutMillis(300); // enough for 256 bytes at 9600
        while (sDMATransferOngoing) {
            // is needed here, because early watchdog ISR sends also data
#ifdef HAL_WWDG_MODULE_ENABLED
            Watchdog_reload();
#endif
            if (tISPR > 0) {
                // here in ISR, check manually for TransferComplete interrupt flag
                if (__HAL_UART_GET_FLAG(&UART_BD_Handle, UART_FLAG_TC) != RESET) {
                    // call ISR Handler manually
                    UART_BD_IRQHANDLER();
                    // Assertion
                    assert_param(__HAL_UART_GET_FLAG(&UART_BD_Handle, UART_FLAG_TC) == RESET);
                }
            }

            if (getSendBufferFreeSpace() >= tSize) {
                break;
            }
            if (isTimeoutSimple()) {
                // skip transfer, don't overwrite
                return;
            }
        }
    }

    /*
     * enough space here
     */
    uint8_t * tStartBufferPointer = tUSARTSendBufferPointerIn;

    int tBufferSizeToEndOfBuffer = (&USARTSendBuffer[UART_SEND_BUFFER_SIZE] - tUSARTSendBufferPointerIn);
    if (tBufferSizeToEndOfBuffer < tSize) {
        //transfer possible, but must be done in 2 chunks since DMA cannot handle buffer wrap around during a transfer
        tSize = tBufferSizeToEndOfBuffer; // set size for 1. chunk
        // copy parameter the hard way
        while (aParameterBufferLength > 0) {
            tUSARTSendBufferPointerIn = putSendBuffer(tUSARTSendBufferPointerIn, *aParameterBufferPointer++);
            aParameterBufferLength--;
        }
        //copy data
        while (aDataBufferLength > 0) {
            tUSARTSendBufferPointerIn = putSendBuffer(tUSARTSendBufferPointerIn, *aDataBufferPointer++);
            aDataBufferLength--;
        }
    } else {
        // copy parameter and data with memcpy
        memcpy((uint8_t *) tUSARTSendBufferPointerIn, aParameterBufferPointer, aParameterBufferLength);
        tUSARTSendBufferPointerIn += aParameterBufferLength;

        if (aDataBufferLength > 0) {
            memcpy((uint8_t *) tUSARTSendBufferPointerIn, aDataBufferPointer, aDataBufferLength);
            tUSARTSendBufferPointerIn += aDataBufferLength;
        }
        // check for buffer wrap around - happens if tBufferSizeToEndOfBuffer == tSize
        if (tUSARTSendBufferPointerIn >= &USARTSendBuffer[UART_SEND_BUFFER_SIZE]) {
            tUSARTSendBufferPointerIn = &USARTSendBuffer[0];
        }
    }
// the only statement which writes the variable sUSARTSendBufferPointerIn
    sUSARTSendBufferPointerIn = tUSARTSendBufferPointerIn;

// start DMA if not already running
    UART_BD_DMA_TX_start((uint32_t) tStartBufferPointer, tSize);
#endif
}

#include <stdlib.h> // for abs()
/**
 * used if databuffer can be greater than USART_SEND_BUFFER_SIZE
 */
void sendUSARTBuffer(uint8_t * aParameterBufferPointer, int aParameterBufferLength, uint8_t * aDataBufferPointer,
        int aDataBufferLength) {
#ifdef USE_SIMPLE_SERIAL
    sendUSARTBufferSimple(aParameterBufferPointer, aParameterBufferLength, aDataBufferPointer, aDataBufferLength);
return;
#else
    if ((aParameterBufferLength + aDataBufferLength) > UART_SEND_BUFFER_SIZE) {
        // first send command
        sendUSARTBufferNoSizeCheck(aParameterBufferPointer, aParameterBufferLength, NULL, 0);
        // then send data in USART_SEND_BUFFER_SIZE chunks
        int tSize = aDataBufferLength;
        while (tSize > 0) {
            int tSendSize = UART_SEND_BUFFER_SIZE;
            if (tSize < UART_SEND_BUFFER_SIZE) {
                tSendSize = tSize;
            }
            sendUSARTBufferNoSizeCheck(aDataBufferPointer, tSendSize, NULL, 0);
            aDataBufferPointer += UART_SEND_BUFFER_SIZE;
            tSize -= UART_SEND_BUFFER_SIZE;
        }
    } else {
        sendUSARTBufferNoSizeCheck(aParameterBufferPointer, aParameterBufferLength, aDataBufferPointer, aDataBufferLength);
    }
#endif
}

#ifdef USE_SIMPLE_SERIAL
/**
 * very simple blocking USART send routine - works 100%!
 */
void sendUSARTBufferSimple(uint8_t * aParameterBufferPointer, int aParameterBufferLength, uint8_t * aDataBufferPointer,
        int aDataBufferLength) {
    while (aParameterBufferLength > 0) {
// wait for USART send buffer to become empty
        while (__HAL_UART_GET_FLAG(&UART_BD_Handle, UART_FLAG_TXE) == RESET) {
            ;
        }

//USART_SendData(UART_BD_Handle.Instance, *aCharPtr);
#ifdef STM32F30X
        UART_BD_Handle.Instance->TDR = (*aParameterBufferPointer & (uint16_t) 0x00FF);
#else
        UART_BD_Handle.Instance->DR = (*aParameterBufferPointer & (uint16_t) 0x00FF);
#endif
        aParameterBufferPointer++;
        aParameterBufferLength--;
    }
    while (aDataBufferLength > 0) {
// wait for USART send buffer to become empty
        while (__HAL_UART_GET_FLAG(&UART_BD_Handle, UART_FLAG_TXE) == RESET) {
            ;
        }
//USART_SendData(UART_BD_Handle.Instance, *aCharPtr);
#ifdef STM32F30X
        UART_BD_Handle.Instance->TDR = (*aDataBufferPointer & (uint16_t) 0x00FF);
#else
        UART_BD_Handle.Instance->DR = (*aDataBufferPointer & (uint16_t) 0x00FF);
#endif
        aDataBufferPointer++;
        aDataBufferLength--;
    }
}
#endif

/**
 * send:
 * 1. Sync Byte A5
 * 2. Byte Function token
 * 3. Short length of parameters (here 5*2)
 * 4. Short n parameters
 */
void sendUSART5Args(uint8_t aFunctionTag, uint16_t aXStart, uint16_t aYStart, uint16_t aXEnd, uint16_t aYEnd, uint16_t aColor) {
    uint16_t tParamBuffer[7];

