ArminJo/android-blue-display/STM32/lib/blueDisplay/src/BlueSerial.cpp
    uint16_t * tBufferPointer = &tParamBuffer[0];
    *tBufferPointer++ = aFunctionTag << 8 | SYNC_TOKEN; // add sync token
    *tBufferPointer++ = 10;
    *tBufferPointer++ = aXStart;
    *tBufferPointer++ = aYStart;
    *tBufferPointer++ = aXEnd;
    *tBufferPointer++ = aYEnd;
    *tBufferPointer++ = aColor;
    sendUSARTBufferNoSizeCheck((uint8_t*) &tParamBuffer[0], 14, NULL, 0);
}

/**
 *
 * @param aFunctionTag
 * @param aNumberOfArgs currently not more than 12 args are supported
 */
void sendUSARTArgs(uint8_t aFunctionTag, int aNumberOfArgs, ...) {
    assertParamMessage((aNumberOfArgs <= MAX_NUMBER_OF_ARGS), aNumberOfArgs, "only 12 params max");

    uint16_t tParamBuffer[MAX_NUMBER_OF_ARGS + 2];
    va_list argp;
    uint16_t * tBufferPointer = &tParamBuffer[0];
    *tBufferPointer++ = aFunctionTag << 8 | SYNC_TOKEN; // add sync token
    va_start(argp, aNumberOfArgs);

    *tBufferPointer++ = aNumberOfArgs * 2;
    int i;
    for (i = 0; i < aNumberOfArgs; ++i) {
        *tBufferPointer++ = va_arg(argp, int);
    }
    va_end(argp);

    sendUSARTBufferNoSizeCheck((uint8_t*) &tParamBuffer[0], aNumberOfArgs * 2 + 4, NULL, 0);
}

/**
 *
 * @param aFunctionTag
 * @param aNumberOfArgs currently not more than 10 args (SHORT) are supported
 */
void sendUSARTArgsAndByteBuffer(uint8_t aFunctionTag, int aNumberOfArgs, ...) {
    if (aNumberOfArgs > MAX_NUMBER_OF_ARGS) {
        return;
    }

    uint16_t tParamBuffer[MAX_NUMBER_OF_ARGS + 4];
    va_list argp;
    uint16_t * tBufferPointer = &tParamBuffer[0];
    *tBufferPointer++ = aFunctionTag << 8 | SYNC_TOKEN; // add sync token
    va_start(argp, aNumberOfArgs);

    // load length of parameter
    *tBufferPointer++ = aNumberOfArgs * 2;
    int i;
    for (i = 0; i < aNumberOfArgs; ++i) {
        *tBufferPointer++ = va_arg(argp, int);
    }
// add data field header
    *tBufferPointer++ = DATAFIELD_TAG_BYTE << 8 | SYNC_TOKEN; // start new transmission block
    uint16_t tLength = va_arg(argp, int); // length in byte
    *tBufferPointer++ = tLength;
    uint8_t * aBufferPtr = (uint8_t *) va_arg(argp, int); // Buffer address
    va_end(argp);

    sendUSARTBufferNoSizeCheck((uint8_t*) &tParamBuffer[0], aNumberOfArgs * 2 + 8, aBufferPtr, tLength);
}

/**
 * Assembles parameter header and appends header for data field
 */
void sendUSART5ArgsAndByteBuffer(uint8_t aFunctionTag, uint16_t aXStart, uint16_t aYStart, uint16_t aParam3, uint16_t aParam4,
        Color_t aColor, uint8_t * aBuffer, int aBufferLength) {

    uint16_t tParamBuffer[9];

    uint16_t * tBufferPointer = &tParamBuffer[0];
    *tBufferPointer++ = aFunctionTag << 8 | SYNC_TOKEN; // add sync token
    *tBufferPointer++ = 10;
    *tBufferPointer++ = aXStart;
    *tBufferPointer++ = aYStart;
    *tBufferPointer++ = aParam3;
    *tBufferPointer++ = aParam4;
    *tBufferPointer++ = aColor;

// add data field header
    *tBufferPointer++ = DATAFIELD_TAG_BYTE << 8 | SYNC_TOKEN; // start new transmission block
    *tBufferPointer++ = aBufferLength; // length in byte

    sendUSARTBuffer((uint8_t*) &tParamBuffer[0], 18, aBuffer, aBufferLength);
}

/**
 * Assembles parameter header and appends header for data field
 */
void sendUSART5ArgsAndShortBuffer(uint8_t aFunctionTag, uint16_t aXStart, uint16_t aYStart, uint16_t aParam3, uint16_t aParam4,
        Color_t aColor, uint16_t * aBuffer, int aBufferLength) {

    uint16_t tParamBuffer[9];

    uint16_t * tBufferPointer = &tParamBuffer[0];
    *tBufferPointer++ = aFunctionTag << 8 | SYNC_TOKEN; // add sync token
    *tBufferPointer++ = 10;
    *tBufferPointer++ = aXStart;
    *tBufferPointer++ = aYStart;
    *tBufferPointer++ = aParam3;
    *tBufferPointer++ = aParam4;
    *tBufferPointer++ = aColor;

// add data field header
    *tBufferPointer++ = DATAFIELD_TAG_SHORT << 8 | SYNC_TOKEN; // start new transmission block
    *tBufferPointer++ = aBufferLength; // length in short

    sendUSARTBuffer((uint8_t*) &tParamBuffer[0], 18, (uint8_t *) aBuffer, aBufferLength * sizeof(uint16_t));
}

/**
 * Get a short from receive buffer, clear it in buffer and handle buffer wrap around
 */
uint16_t getReceiveBufferWord(void) {
    uint8_t * tUSARTReceiveBufferPointer = sUSARTReceiveBufferPointer;
    if (tUSARTReceiveBufferPointer >= &USARTReceiveBuffer[USART_RECEIVE_BUFFER_SIZE]) {
        // - since pointer may be far behind buffer end
        tUSARTReceiveBufferPointer -= USART_RECEIVE_BUFFER_SIZE;
    }
    uint16_t tResult = *tUSARTReceiveBufferPointer;
    *tUSARTReceiveBufferPointer = 0x00;
    tUSARTReceiveBufferPointer++;
    if (tUSARTReceiveBufferPointer >= &USARTReceiveBuffer[USART_RECEIVE_BUFFER_SIZE]) {
        tUSARTReceiveBufferPointer = &USARTReceiveBuffer[0];
    }
    tResult |= (*tUSARTReceiveBufferPointer) << 8;
    *tUSARTReceiveBufferPointer = 0x00;
    tUSARTReceiveBufferPointer++;
    if (tUSARTReceiveBufferPointer >= &USARTReceiveBuffer[USART_RECEIVE_BUFFER_SIZE]) {
        tUSARTReceiveBufferPointer = &USARTReceiveBuffer[0];
    }
    sLastRXDMACount -= 2;
    if (sLastRXDMACount <= 0) {
        sLastRXDMACount += USART_RECEIVE_BUFFER_SIZE;
    }
    sUSARTReceiveBufferPointer = tUSARTReceiveBufferPointer;
    return tResult;
}

/**
 * Get a byte from receive buffer, clear it in buffer and handle buffer wrap around
 */
uint8_t getReceiveBufferByte(void) {
    uint8_t * tUSARTReceiveBufferPointer = sUSARTReceiveBufferPointer;
    uint8_t tResult = *tUSARTReceiveBufferPointer;
    *tUSARTReceiveBufferPointer = 0x00;
    tUSARTReceiveBufferPointer++;
    if (tUSARTReceiveBufferPointer >= &USARTReceiveBuffer[USART_RECEIVE_BUFFER_SIZE]) {
        tUSARTReceiveBufferPointer = &USARTReceiveBuffer[0];
    }
    sLastRXDMACount--;
    if (sLastRXDMACount <= 0) {
        sLastRXDMACount += USART_RECEIVE_BUFFER_SIZE;
    }
    sUSARTReceiveBufferPointer = tUSARTReceiveBufferPointer;
    return tResult;
}

