ArminJo/android-blue-display/STM32/lib/blueDisplay/src/BlueSerial.cpp
/*
 * computes received bytes since LastRXDMACount
 */
int32_t getReceiveBytesAvailable(void) {
    int32_t tCount = UART_BD_Handle.hdmarx->Instance->CNDTR;
    if (tCount <= sLastRXDMACount) {
        return sLastRXDMACount - tCount;
    } else {
        // DMA wrap around
        return sLastRXDMACount + (USART_RECEIVE_BUFFER_SIZE - tCount);
    }
}

/**
 * Check if a touch event has completely received by USART
 * Function is not synchronized because it should only be used by main thread
 */
static uint8_t sReceivedEventType = EVENT_TAG_NO_EVENT;

void checkAndHandleMessageReceived(void) {
// get actual DMA byte count
    int32_t tBytesAvailable = getReceiveBytesAvailable();
    if (tBytesAvailable == 0) {
        return;
    }
    if (sReceiveBufferOutOfSync) {
        while (tBytesAvailable-- > 0) {
            // just wait for next sync token
            if (getReceiveBufferByte() == SYNC_TOKEN) {
                sReceiveBufferOutOfSync = false;
                sReceivedEventType = EVENT_TAG_NO_EVENT;
                break;
            }
        }
    }
    if (!sReceiveBufferOutOfSync) {
        /*
         * regular operation here
         * enough bytes available for next step?
         */
        if (sReceivedEventType == EVENT_TAG_NO_EVENT) {
            if (tBytesAvailable >= 2) {
                /*
                 * read message length and event tag first
                 */
                // length is not needed
                int tLength = getReceiveBufferByte();
                if (tLength > TOUCH_COMMAND_SIZE_BYTE_MAX) {
                    // invalid length
                    sReceiveBufferOutOfSync = true;
                    return;
                }
                sReceivedEventType = getReceiveBufferByte();
                tBytesAvailable -= 2;
            }
        }
        if (sReceivedEventType != EVENT_TAG_NO_EVENT) {
            uint8_t tDataSize;
            if (sReceivedEventType < EVENT_TAG_FIRST_CALLBACK_ACTION_CODE) {
                // Touch event
                tDataSize = RECEIVE_TOUCH_OR_DISPLAY_DATA_SIZE;
            } else {
                // Callback event
                tDataSize = RECEIVE_CALLBACK_DATA_SIZE;
            }
            if (tBytesAvailable > tDataSize) {
                // touch or size event complete received, now read data and sync token
                // copy buffer to structure
                unsigned char * tByteArrayPtr = remoteTouchEvent.EventData.ByteArray;
                int i;
                for (i = 0; i < tDataSize; ++i) {
                    *tByteArrayPtr++ = getReceiveBufferByte();
                }
                // Check for sync token
                if (getReceiveBufferByte() == SYNC_TOKEN) {
                    remoteTouchEvent.EventType = sReceivedEventType;
                    sReceivedEventType = EVENT_TAG_NO_EVENT;
                    handleEvent(&remoteTouchEvent);
                } else {
                    sReceiveBufferOutOfSync = true;
                }
            }
        }
    }
}

/*
 * NOT USED YET - maybe useful for Error Interrupt IT_TE2
 */
// starting a new DMA just after DMA TC interrupt corrupts the last byte of the transfer still ongoing.
extern "C" void DMA1_Channel2_IRQHandler(void) {
// Test on DMA Transfer Complete interrupt
    if (__HAL_DMA_GET_FLAG(UART_BD_Handle.hdmatx, DMA_FLAG_TC2)) {
        /* Clear DMA  Transfer Complete interrupt pending bit */
        __HAL_DMA_CLEAR_FLAG(UART_BD_Handle.hdmatx, DMA_FLAG_TC2);
        //DMA_ClearITPendingBit(DMA1_IT_TC2);
//sUSARTDmaReady = true;
    }
// Test on DMA Transfer Error interrupt
    if (__HAL_DMA_GET_FLAG(UART_BD_Handle.hdmatx, DMA_FLAG_TE2)) {
        failParamMessage(UART_BD_Handle.hdmatx->Instance->CPAR, "DMA Error");
        __HAL_DMA_CLEAR_FLAG(UART_BD_Handle.hdmatx, DMA_FLAG_TE2);
        //DMA_ClearITPendingBit(DMA1_IT_TE2);
    }
// Test on DMA Transfer Half interrupt
    if (__HAL_DMA_GET_FLAG(UART_BD_Handle.hdmatx, DMA_FLAG_HT2)) {
        __HAL_DMA_CLEAR_FLAG(UART_BD_Handle.hdmatx, DMA_FLAG_HT2);
        //DMA_ClearITPendingBit(DMA1_IT_HT2);
    }
}

